#include <iostream>

int main()
{




    // 코드       // 레터럴
    std::cout << "123###456\n";
    std::cout << std::endl;

    // 영화 <-> 게임
    // 플레이어가 가상세계에 개입을 할수 있단

    // 빌드 -> 컴파일러 -> 번역 -> exe 파일 생성된다.
    // 문제 해결 능력 ( 논리 구성 능력 )
    // 디버깅 능력

    // 한줄씩 실행 F10
    // 한번에 실행 F5 (당분간 사용하지 않는다)

    // 숙제를 할때 지켜줘야할 조건

    // 1. 구글링 또는 검색 하시면 안됩니다.
    // 2. 훈련해야할 시기
    // 3. 복붙 X
    // 4. 밀리면 안된다.
    // 5. 검색해도 답이 안나온다

    // 숙제 소요시간 2 ~ 5 시간
    // 아르바이트 병행하시거나 직장을 하시면

    // 24시간정도 지나면 50프로 를까먹는다

    // 숫자를 메모리에 저장하고 불러오고 계산하방법을 배운다.

    // 변수
    // 숫자, 글자

    //integer ( 정수 )
    //0 123 45 -1 -2 
    // 데이터 타입 이름

    // ==

    // 변수 이름 대소문자는 구분된다
    // 변수 이름 숫자 사용 가능하다 대신 숫자부터 시작하면
    // 안된다.

    int num = 0;    // 초기화
    num = 20;       // 대입연산자

    int A12931023 = 200;
    int a = 200;
    int b = 300;

    // std::cout << num;

    // + 더하기
    // - 빼기
    // / 나누기
    // * 곱하기
    // % 나머지

    int num2 = 7 / 3;
    num2 = 7 % 3;

    num2 = 3 * (2 + 1);

    // 설계 알고리즘?

    // 게임을 만드는데 있어서 제일 중요한건 시간
    // 일단 화면에 나오게 구현이 우선
    // 기술충 -> 포트폴리오 안나온다.
    // 게임만들어야하는데 dx 렌더링 기술 -> 툴제작 기술

    // 1. 디버깅 60%

    // 2. 문자열(문자) 20

    // 3. 파일입출력 20

    return 0;
}


